CSI API ETABS v1

# eWallPierRebarLayerType Enumeration

---

The pier rebar types.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eWallPierRebarLayerType

    Public Enumeration eWallPierRebarLayerType

    Dim instance As eWallPierRebarLayerType

    public enum class eWallPierRebarLayerType

    type eWallPierRebarLayerType

Members

| Member name| Value| Description
---|---|---|---
| Vertical_Distributed_MiddleZone_Eachface| 1|
| Horizontal_Distributed_MiddleZone_Eachface| 2|
| Vertical_Distributed_EndZoneI_Total| 3|
| Vertical_Distributed_EndZoneJ_Total| 4|
| Confinement_EndZoneI| 5|
| Confinement_EndZoneJ| 6|
| Diagonal_Each| 7|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com